android-eris-step-by-step.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>android-eris-step-by-step</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="android-eris-step-by-step"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-04-21T16:18-0700"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">android-eris-step-by-step</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Building Your First App with the Eclipse and Android Development Tools (ADT)</a>
<ul>
<li><a href="#sec-1-1">1.1 Eclipse Tips</a></li>
<li><a href="#sec-1-2">1.2 Files</a></li>
<li><a href="#sec-1-3">1.3 Build My First App</a></li>
<li><a href="#sec-1-4">1.4 Uninstall My First App</a></li>
<li><a href="#sec-1-5">1.5 [0/6] Create a Linear Layout</a></li>
<li><a href="#sec-1-6">1.6 [0/4] Starting Another Activity</a>
<ul>
<li><a href="#sec-1-6-1">1.6.1 [0/5] Respond to the Send Button</a></li>
<li><a href="#sec-1-6-2">1.6.2 [0/4] Build An Intent</a></li>
<li><a href="#sec-1-6-3">1.6.3 [0/6] Create the Second Activity</a></li>
<li><a href="#sec-1-6-4">1.6.4 [0/4] Receive the Intent</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 Step by step Tuesday, April 16</a></li>
<li><a href="#sec-3">3 [0/2] Create a Project with Command Line Tools</a></li>
<li><a href="#sec-4">4 Step by step</a></li>
<li><a href="#sec-5">5 Installing CyanogenMod from recovery</a></li>
<li><a href="#sec-6">6 Log</a></li>
<li><a href="#sec-7">7 Android Applications</a>
<ul>
<li><a href="#sec-7-1">7.1 Free voice calls</a></li>
</ul>
</li>
<li><a href="#sec-8">8 HTC Droid Eris</a></li>
<li><a href="#sec-9">9 Build</a></li>
<li><a href="#sec-10">10 Links</a></li>
<li><a href="#sec-11">11 Android Applications</a>
<ul>
<li><a href="#sec-11-1">11.1 GrooVe IP Lite</a>
<ul>
<li><a href="#sec-11-1-1">11.1.1 Echo problem on reciever end</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> <a href="http://developer.android.com/training/basics/firstapp/index.html">Building Your First App</a> with the <a href="http://en.wikipedia.org/wiki/Eclipse_(software)">Eclipse</a> and Android Development Tools (ADT)</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Eclipse Tips</h3>
<div class="outline-text-3" id="text-1-1">

<dl>
<dt>Source &gt; Organize Imports</dt><dd>Shift+Ctrl+O
</dd>
</dl>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Files</h3>
<div class="outline-text-3" id="text-1-2">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">File</th><th scope="col" class="left">Path</th></tr>
</thead>
<tbody>
<tr><td class="left">activity<sub>main</sub>.xml</td><td class="left"><a href="file:///home/troy/workspace/MyFirstApp/res/layout/activity_main.xml">~/workspace/MyFirstApp/res/layout/activity_main.xml</a></td></tr>
<tr><td class="left">strings.xml</td><td class="left"><a href="file:///home/troy/workspace/MyFirstApp/res/values/strings.xml">~/workspace/MyFirstApp/res/values/strings.xml</a></td></tr>
<tr><td class="left">MainActivity.java</td><td class="left"><a href="file:///home/troy/workspace/MyFirstApp/src/com/example/myfirstapp/MainActivity.java">~/workspace/MyFirstApp/src/com/example/myfirstapp/MainActivity.java</a></td></tr>
<tr><td class="left">DisplayMessageActivity.java</td><td class="left"><a href="file:///home/troy/workspace/MyFirstApp/src/com/example/myfirstapp/DisplayMessageActivity.java">~/workspace/MyFirstApp/src/com/example/myfirstapp/DisplayMessageActivity.java</a></td></tr>
<tr><td class="left">AndroidManifest.xml</td><td class="left"><a href="file:///home/troy/workspace/MyFirstApp/AndroidManifest.xml">~/workspace/MyFirstApp/AndroidManifest.xml</a></td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> <span class="todo TODO">TODO</span> Build My First App</h3>
<div class="outline-text-3" id="text-1-3">

<ol>
<li><code>[&nbsp;]</code> Start Eclipse
<ul>
<li>Error Loading DDMS Preferences
<ul>
<li>Add "android" binary to path
</li>
</ul>

</li>
</ul>

</li>
<li><code>[&nbsp;]</code> New Android Application
</li>
<li><code>[&nbsp;]</code> Application = My First App
</li>
<li><code>[&nbsp;]</code> Minimum Required SDK, Target SDK, Compile With = API 10: Android 2.3.3. (Gingerbread)
</li>
<li><code>[&nbsp;]</code> Theme = None
</li>
<li><code>[&nbsp;]</code> Finish
</li>
</ol>

</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> <span class="todo TODO">TODO</span> Uninstall My First App</h3>
<div class="outline-text-3" id="text-1-4">




<pre class="example"># -d directs command to the only connected USB device
#           returns an error if more than one USB device is present.
# -e directs command to the only running emulator.

adb -d uninstall com.example.myfirstapp
adb -e uninstall com.example.myfirstapp
</pre>

</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> <span class="todo TODO">TODO</span> [0/6] Create a Linear Layout</h3>
<div class="outline-text-3" id="text-1-5">

<ol>
<li><code>[&nbsp;]</code> Open <a href="file:///home/troy/workspace/MyFirstApp/res/layout/activity_main.xml">~/workspace/MyFirstApp/res/layout/activity_main.xml</a>
</li>
<li><code>[&nbsp;]</code> Create a <a href="http://developer.android.com/training/basics/firstapp/building-ui.html#LinearLayout">Linear Layout</a>
<ol>
<li><code>[&nbsp;]</code> Delete the &lt;TextView&gt; element
</li>
<li><code>[&nbsp;]</code> Change the &lt;RelativeLayout&gt; element to &lt;LinearLayout&gt;
</li>
<li><code>[&nbsp;]</code> Add the android:orientation attribute and set it to "horizontal"
</li>
</ol>

</li>
<li><code>[&nbsp;]</code> Add a <a href="http://developer.android.com/training/basics/firstapp/building-ui.html#TextInput">Text Field</a>
</li>
<li><code>[&nbsp;]</code> Add <a href="http://developer.android.com/training/basics/firstapp/building-ui.html#Strings">String Resources</a> to <a href="file:///home/troy/workspace/MyFirstApp/res/values/strings.xml">~/workspace/MyFirstApp/res/values/strings.xml</a>
<ol>
<li><code>[&nbsp;]</code> edit<sub>message</sub>
</li>
<li><code>[&nbsp;]</code> button<sub>send</sub>
</li>
</ol>

</li>
<li><code>[&nbsp;]</code> Add <a href="http://developer.android.com/training/basics/firstapp/building-ui.html#Button">a Button</a> to <a href="file:///home/troy/workspace/MyFirstApp/res/layout/activity_main.xml">~/workspace/MyFirstApp/res/layout/activity_main.xml</a> following &lt;EditText&gt;
</li>
<li><code>[&nbsp;]</code> Make the <a href="http://developer.android.com/training/basics/firstapp/building-ui.html#Weight">Input Box Fill in the Screen Width</a> in <a href="file:///home/troy/workspace/MyFirstApp/res/layout/activity_main.xml">~/workspace/MyFirstApp/res/layout/activity_main.xml</a>
</li>
</ol>

</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> <span class="todo TODO">TODO</span> [0/4] Starting <a href="http://developer.android.com/training/basics/firstapp/starting-activity.html">Another Activity</a></h3>
<div class="outline-text-3" id="text-1-6">


</div>

<div id="outline-container-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> <span class="todo TODO">TODO</span> [0/5] Respond to the <a href="http://developer.android.com/training/basics/firstapp/starting-activity.html#RespondToButton">Send Button</a></h4>
<div class="outline-text-4" id="text-1-6-1">

<ol>
<li><code>[&nbsp;]</code> add the android:onClick attribute to the &lt;Button&gt; element in <a href="file:///home/troy/workspace/MyFirstApp/res/layout/activity_main.xml">~/workspace/MyFirstApp/res/layout/activity_main.xml</a>



<pre class="example">&lt;Button
    android:layout_width="wrap_content"
    android:layout_height="wrap_content"
    android:text="@string/button_send"
    android:onClick="sendMessage" /&gt;
</pre>

</li>
<li><code>[&nbsp;]</code> Add the corresponding sendMessage method to <a href="file:///home/troy/workspace/MyFirstApp/src/com/example/myfirstapp/MainActivity.java">~/workspace/MyFirstApp/src/com/example/myfirstapp/MainActivity.java</a>



<pre class="example">/** Called when the user clicks the Send button */
public void sendMessage(View view) {
    // Do something in response to button
}
</pre>

</li>
<li><code>[&nbsp;]</code> import android.view.View; in <a href="file:///home/troy/workspace/MyFirstApp/src/com/example/myfirstapp/MainActivity.java">~/workspace/MyFirstApp/src/com/example/myfirstapp/MainActivity.java</a>
</li>
<li><code>[&nbsp;]</code> Run on an emulater
</li>
<li><code>[&nbsp;]</code> (Optional) Run on a real device
</li>
</ol>

</div>

</div>
