android-eris-step-by-step.org
*** TODO [0/4] Build [[http://developer.android.com/training/basics/firstapp/starting-activity.html#BuildIntent][An Intent]]
    1. [ ] Create an [[http://developer.android.com/reference/android/content/Intent.html][Intent]] inside the sendMessage() method in
           file:~/workspace/MyFirstApp/src/com/example/myfirstapp/MainActivity.java
       #+BEGIN_SRC java
         Intent intent = new Intent(this, DisplayMessageActivity.class);
       #+END_SRC
    2. [ ] use findViewById() to get the EditText element and add its text value to the intent in [[file:~/workspace/MyFirstApp/src/com/example/myfirstapp/MainActivity.java][MainActivity.java]]
       #+BEGIN_SRC java
         Intent intent = new Intent(this, DisplayMessageActivity.class);
         EditText editText = (EditText) findViewById(R.id.edit_message);
         String message = editText.getText().toString();
         intent.putExtra(EXTRA_MESSAGE, message);
         startActivity(intent);
       #+END_SRC
    3. [ ] Add import statements to [[file:~/workspace/MyFirstApp/src/com/example/myfirstapp/MainActivity.java][MainActivity.java]]
       #+BEGIN_SRC java
         import android.content.Intent;
         import android.widget.EditText;
       #+END_SRC
    4. [ ] Define the key for the intent's extra using a public constant in [[file:~/workspace/MyFirstApp/src/com/example/myfirstapp/MainActivity.java][MainActivity.java]]
       #+BEGIN_SRC java
         public class MainActivity extends Activity {
             public final static String EXTRA_MESSAGE = "com.example.myfirstapp.MESSAGE";
             ...
         }
       #+END_SRC
*** TODO [0/6] Create [[http://developer.android.com/training/basics/firstapp/starting-activity.html#CreateActivity][the Second Activity]]
    1. [ ] New Android Blank Activity
       - Project :: MyFirstApp
       - Activity Name :: DisplayMessageActivity
       - Layout Name :: activity_display_message
       - Title :: My Message
       - Hierarchial Parent :: com.example.myfirstapp.MainActivity
       - Navigation Type :: None
    2. [ ] Open file:~/workspace/MyFirstApp/src/com/example/myfirstapp/DisplayMessageActivity.java
    3. [ ] Remove onCreateOptionsMenu method per web page instruction
    4. [ ] @SuppressLint("NewApi") in file:~/workspace/MyFirstApp/src/com/example/myfirstapp/DisplayMessageActivity.java
       - [ ] import android.annotation.SuppressLint; or else an error results
    5. [ ] Add the title string to [[file:~/workspace/MyFirstApp/res/values/strings.xml][strings.xml]] if not using Eclipse
       #+BEGIN_SRC xml
          <string name="title_activity_display_message">My Message</string>
       #+END_SRC
       - Note: This string was added by Eclipse
    6. [ ] Add it to the manifest file < [[file:~/workspace/MyFirstApp/AndroidManifest.xml][AndroidManifest.xml]] > if not using Eclipse
       - This is done automatically if Eclipse
*** TODO [0/4] Receive [[http://developer.android.com/training/basics/firstapp/starting-activity.html#ReceiveIntent][the Intent]]
    1. [ ] Place following code after "super.onCreate(savedInstanceState);" in onCreate method in [[file:~/workspace/MyFirstApp/src/com/example/myfirstapp/DisplayMessageActivity.java][DisplayMessageActivity.java]]
       #+BEGIN_SRC java
         // Get the message from the intent
         Intent intent = getIntent();
         String message = intent.getStringExtra(MainActivity.EXTRA_MESSAGE);
       #+END_SRC
    2. [ ] Display the message in [[file:~/workspace/MyFirstApp/src/com/example/myfirstapp/DisplayMessageActivity.java][DisplayMessageActivity.java]]
       - Place after the code from the previous step
       #+BEGIN_SRC java
         // Create the text view
         TextView textView = new TextView(this);
         textView.setTextSize(40);
         textView.setText(message);
       #+END_SRC
    3. [ ] Run the app!
       - import android.annotation.TargetApi;
       - import android.widget.TextView;
    4. [ ] TDW

* Step by step Tuesday, April 16
  1. [ ] Power off
  2. [ ] Volume down and power on
  3. [ ] Volume up
  4. [ ] Partition sdcard
     1. [ ] Partition SD
     2. [ ] Press twice
     3. [ ] Swap-size = 32 MB => 64 MB
     4. [ ] Ext2-size = 512 MB => 1024 MB
     5. [ ] Volume down to return
  5. [ ] USB-MS toggle
  6. [ ] Download [[http://wiki.cyanogenmod.org/w/Desirec_Info][Desirec Info]] [[http://download.cyanogenmod.org/?type=stable&device=desirec][stable build]] [[http://download.cyanogenmod.org/get/jenkins/2823/cm-7.2.0-desirec.zip][cm-7.2.0-desirec.zip]] md5sum = bd03e5ca49e8770cc00b319dd939336c
  7. [ ] cp cm-7.2.0-desirec.zip to sd card
  8. [ ] Press Trackball to disable USB-MS
  9. [ ] Flash zip from sdcard
      1. [ ] Choose SDCARD:cm-7.2.0-desirec.zip
      2. [ ] Press trackball to confirm
  10. [ ] Reboot system now


  7. [ ] start adb as root
     #+BEGIN_SRC sh
       sudo adb
     #+END_SRC
   
* TODO [0/2] Create a Project with Command Line Tools
   1. [ ] list targets
      #+BEGIN_SRC sh
        android list targets
      #+END_SRC
   2. [ ] 
      #+BEGIN_SRC sh :tangle build-first-app.sh
        #!/bin/sh
        TARGET_ID="android-10"
        # TARGET_ID="Google Inc.:Google APIs:10"
        PATH_TO_WORKSPACE="/home/troy/workspace"

        android create project --target $TARGET_ID --name MyFirstApp \
        --path $PATH_TO_WORKSPACE/MyFirstApp --activity MainActivity \
        --package com.example.myfirstapp
      #+END_SRC
* Step by step
1. [ ] Order tethering cable
   - USB Data Cable For HTC Droid Eris
   - Total:	$7.98
   - http://www.cellphoneshop.net/
2. [ ] Order 8 GB MicroSDHC Card
   - 2254.30
3. [ ] http://wiki.cyanogenmod.org/w/Main_Page
4. [ ] About / what
5. [ ] How to install
6. [ ] http://wiki.cyanogenmod.org/w/Desirec_Info
7. [ ] 
* Installing CyanogenMod from recovery
1. [ ] partition sd card
2. [ ] Download cm-7-20130301-NIGHTLY-desirec.zip
3. [ ] Place the CyanogenMod rom .zip file on the root of the SD card
   #+BEGIN_SRC sh
     adb push cm-7-20130301-NIGHTLY-desirec.zip /sdcard
   #+END_SRC
4. [ ] Flash zip from sdcard
   #+BEGIN_EXAMPLE
   E: No zip files found
   #+END_EXAMPLE
5. [ ] Install gapps-gb-20110828-signed.zip
* Log
* Android Applications
** Free voice calls
