android-eris-step-by-step.html

<div id="outline-container-1-6-2" class="outline-4">
<h4 id="sec-1-6-2"><span class="section-number-4">1.6.2</span> <span class="todo TODO">TODO</span> [0/4] Build <a href="http://developer.android.com/training/basics/firstapp/starting-activity.html#BuildIntent">An Intent</a></h4>
<div class="outline-text-4" id="text-1-6-2">

<ol>
<li><code>[&nbsp;]</code> Create an <a href="http://developer.android.com/reference/android/content/Intent.html">Intent</a> inside the sendMessage() method in
           <a href="file:///home/troy/workspace/MyFirstApp/src/com/example/myfirstapp/MainActivity.java">~/workspace/MyFirstApp/src/com/example/myfirstapp/MainActivity.java</a>



<pre class="example">Intent intent = new Intent(this, DisplayMessageActivity.class);
</pre>

</li>
<li><code>[&nbsp;]</code> use findViewById() to get the EditText element and add its text value to the intent in <a href="file:///home/troy/workspace/MyFirstApp/src/com/example/myfirstapp/MainActivity.java">MainActivity.java</a>



<pre class="example">Intent intent = new Intent(this, DisplayMessageActivity.class);
EditText editText = (EditText) findViewById(R.id.edit_message);
String message = editText.getText().toString();
intent.putExtra(EXTRA_MESSAGE, message);
startActivity(intent);
</pre>

</li>
<li><code>[&nbsp;]</code> Add import statements to <a href="file:///home/troy/workspace/MyFirstApp/src/com/example/myfirstapp/MainActivity.java">MainActivity.java</a>



<pre class="example">import android.content.Intent;
import android.widget.EditText;
</pre>

</li>
<li><code>[&nbsp;]</code> Define the key for the intent's extra using a public constant in <a href="file:///home/troy/workspace/MyFirstApp/src/com/example/myfirstapp/MainActivity.java">MainActivity.java</a>



<pre class="example">public class MainActivity extends Activity {
    public final static String EXTRA_MESSAGE = "com.example.myfirstapp.MESSAGE";
    ...
}
</pre>

</li>
</ol>

</div>

</div>

<div id="outline-container-1-6-3" class="outline-4">
<h4 id="sec-1-6-3"><span class="section-number-4">1.6.3</span> <span class="todo TODO">TODO</span> [0/6] Create <a href="http://developer.android.com/training/basics/firstapp/starting-activity.html#CreateActivity">the Second Activity</a></h4>
<div class="outline-text-4" id="text-1-6-3">

<ol>
<li><code>[&nbsp;]</code> New Android Blank Activity
<dl>
<dt>Project</dt><dd>MyFirstApp
</dd>
<dt>Activity Name</dt><dd>DisplayMessageActivity
</dd>
<dt>Layout Name</dt><dd>activity<sub>display</sub><sub>message</sub>
</dd>
<dt>Title</dt><dd>My Message
</dd>
<dt>Hierarchial Parent</dt><dd>com.example.myfirstapp.MainActivity
</dd>
<dt>Navigation Type</dt><dd>None
</dd>
</dl>

</li>
<li><code>[&nbsp;]</code> Open <a href="file:///home/troy/workspace/MyFirstApp/src/com/example/myfirstapp/DisplayMessageActivity.java">~/workspace/MyFirstApp/src/com/example/myfirstapp/DisplayMessageActivity.java</a>
</li>
<li><code>[&nbsp;]</code> Remove onCreateOptionsMenu method per web page instruction
</li>
<li><code>[&nbsp;]</code> @SuppressLint("NewApi") in <a href="file:///home/troy/workspace/MyFirstApp/src/com/example/myfirstapp/DisplayMessageActivity.java">~/workspace/MyFirstApp/src/com/example/myfirstapp/DisplayMessageActivity.java</a>
<ul>
<li><code>[&nbsp;]</code> import android.annotation.SuppressLint; or else an error results
</li>
</ul>

</li>
<li><code>[&nbsp;]</code> Add the title string to <a href="file:///home/troy/workspace/MyFirstApp/res/values/strings.xml">strings.xml</a> if not using Eclipse



<pre class="example">&lt;string name="title_activity_display_message"&gt;My Message&lt;/string&gt;
</pre>

<ul>
<li>Note: This string was added by Eclipse
</li>
</ul>

</li>
<li><code>[&nbsp;]</code> Add it to the manifest file &lt; <a href="file:///home/troy/workspace/MyFirstApp/AndroidManifest.xml">AndroidManifest.xml</a> &gt; if not using Eclipse
<ul>
<li>This is done automatically if Eclipse
</li>
</ul>

</li>
</ol>

</div>

</div>

<div id="outline-container-1-6-4" class="outline-4">
<h4 id="sec-1-6-4"><span class="section-number-4">1.6.4</span> <span class="todo TODO">TODO</span> [0/4] Receive <a href="http://developer.android.com/training/basics/firstapp/starting-activity.html#ReceiveIntent">the Intent</a></h4>
<div class="outline-text-4" id="text-1-6-4">

<ol>
<li><code>[&nbsp;]</code> Place following code after "super.onCreate(savedInstanceState);" in onCreate method in <a href="file:///home/troy/workspace/MyFirstApp/src/com/example/myfirstapp/DisplayMessageActivity.java">DisplayMessageActivity.java</a>



<pre class="example">// Get the message from the intent
Intent intent = getIntent();
String message = intent.getStringExtra(MainActivity.EXTRA_MESSAGE);
</pre>

</li>
<li><code>[&nbsp;]</code> Display the message in <a href="file:///home/troy/workspace/MyFirstApp/src/com/example/myfirstapp/DisplayMessageActivity.java">DisplayMessageActivity.java</a>
<ul>
<li>Place after the code from the previous step



<pre class="example">// Create the text view
TextView textView = new TextView(this);
textView.setTextSize(40);
textView.setText(message);
</pre>

</li>
<li><code>[&nbsp;]</code> Run the app!
<ul>
<li>import android.annotation.TargetApi;
</li>
<li>import android.widget.TextView;
</li>
</ul>

</li>
<li><code>[&nbsp;]</code> TDW
</li>
</ol>


</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Step by step Tuesday, April 16</h2>
<div class="outline-text-2" id="text-2">

<ol>
<li><code>[&nbsp;]</code> Power off
</li>
<li><code>[&nbsp;]</code> Volume down and power on
</li>
<li><code>[&nbsp;]</code> Volume up
</li>
<li><code>[&nbsp;]</code> Partition sdcard
<ol>
<li><code>[&nbsp;]</code> Partition SD
</li>
<li><code>[&nbsp;]</code> Press twice
</li>
<li><code>[&nbsp;]</code> Swap-size = 32 MB =&gt; 64 MB
</li>
<li><code>[&nbsp;]</code> Ext2-size = 512 MB =&gt; 1024 MB
</li>
<li><code>[&nbsp;]</code> Volume down to return
</li>
</ol>

</li>
<li><code>[&nbsp;]</code> USB-MS toggle
</li>
<li><code>[&nbsp;]</code> Download <a href="http://wiki.cyanogenmod.org/w/Desirec_Info">Desirec Info</a> <a href="http://download.cyanogenmod.org/?type=stable&amp;device=desirec">stable build</a> <a href="http://download.cyanogenmod.org/get/jenkins/2823/cm-7.2.0-desirec.zip">cm-7.2.0-desirec.zip</a> md5sum = bd03e5ca49e8770cc00b319dd939336c
</li>
<li><code>[&nbsp;]</code> cp cm-7.2.0-desirec.zip to sd card
</li>
<li><code>[&nbsp;]</code> Press Trackball to disable USB-MS
</li>
<li><code>[&nbsp;]</code> Flash zip from sdcard
<ol>
<li><code>[&nbsp;]</code> Choose SDCARD:cm-7.2.0-desirec.zip
</li>
<li><code>[&nbsp;]</code> Press trackball to confirm
</li>
</ol>

</li>
<li><code>[&nbsp;]</code> Reboot system now
</li>
</ol>



<ol>
<li><code>[&nbsp;]</code> start adb as root



<pre class="example">sudo adb
</pre>

</li>
</ol>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> [0/2] Create a Project with Command Line Tools</h2>
<div class="outline-text-2" id="text-3">

<ol>
<li><code>[&nbsp;]</code> list targets



<pre class="example">android list targets
</pre>

</li>
<li><code>[&nbsp;]</code> 



<pre class="example">#!/bin/sh
TARGET_ID="android-10"
# TARGET_ID="Google Inc.:Google APIs:10"
PATH_TO_WORKSPACE="/home/troy/workspace"

android create project --target $TARGET_ID --name MyFirstApp \
--path $PATH_TO_WORKSPACE/MyFirstApp --activity MainActivity \
--package com.example.myfirstapp
</pre>

</li>
</ol>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Step by step</h2>
<div class="outline-text-2" id="text-4">

<ol>
<li><code>[&nbsp;]</code> Order tethering cable
<ul>
<li>USB Data Cable For HTC Droid Eris
</li>
<li>Total:     $7.98
</li>
<li><a href="http://www.cellphoneshop.net/">http://www.cellphoneshop.net/</a>
</li>
</ul>

</li>
<li><code>[&nbsp;]</code> Order 8 GB MicroSDHC Card
<ul>
<li>2254.30
</li>
</ul>

</li>
<li><code>[&nbsp;]</code> <a href="http://wiki.cyanogenmod.org/w/Main_Page">http://wiki.cyanogenmod.org/w/Main_Page</a>
</li>
<li><code>[&nbsp;]</code> About / what
</li>
<li><code>[&nbsp;]</code> How to install
</li>
<li><code>[&nbsp;]</code> <a href="http://wiki.cyanogenmod.org/w/Desirec_Info">http://wiki.cyanogenmod.org/w/Desirec_Info</a>
</li>
<li><code>[&nbsp;]</code> 
</li>
</ol>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Installing CyanogenMod from recovery</h2>
<div class="outline-text-2" id="text-5">

<ol>
<li><code>[&nbsp;]</code> partition sd card
</li>
<li><code>[&nbsp;]</code> Download cm-7-20130301-NIGHTLY-desirec.zip
</li>
<li><code>[&nbsp;]</code> Place the CyanogenMod rom .zip file on the root of the SD card



<pre class="example">adb push cm-7-20130301-NIGHTLY-desirec.zip /sdcard
</pre>

</li>
<li><code>[&nbsp;]</code> Flash zip from sdcard



<pre class="example">E: No zip files found
</pre>

</li>
<li><code>[&nbsp;]</code> Install gapps-gb-20110828-signed.zip
</li>
</ol>

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Log</h2>
<div class="outline-text-2" id="text-6">

</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Android Applications</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Free voice calls</h3>
<div class="outline-text-3" id="text-7-1">

</div>
</div>

</div>
