android-eris-step-by-step.org
* HTC Droid Eris
  - Screen :: 3.2 inch HVGA 320x480
  - Device Definition :: 3.2" HVGA slider ADP1 (320 x 480, Normal mdpi screen)  
* Build
  1. [ ] [[http://wiki.cyanogenmod.org/w/Build_for_desirec]]
  2. [ ] 
     #+BEGIN_SRC sh
       mkdir -p ~/bin
       mkdir -p ~/android/system
     #+END_SRC
  3. [ ] repo
     #+BEGIN_SRC sh
       cd ~/bin && wget https://dl-ssl.google.com/dl/googlesource/git-repo/repo && chmod +x ~/bin/repo
     #+END_SRC
  4. [ ] path
     #+BEGIN_SRC sh
       export PATH=${PATH}:~/bin
     #+END_SRC
  5. [ ]
      #+BEGIN_SRC sh
	cd ~/android/system/
	repo init -u git://github.com/CyanogenMod/android.git -b gingerbread
      #+END_SRC
      #+BEGIN_SRC sh
	repo sync
      #+END_SRC
  6. [ ] Get prebuilt Rom Manager
     #+BEGIN_SRC sh
        cd ~/android/system/vendor/cyanogen && ./get-rommanager
     #+END_SRC
  7. [ ] 
     #+BEGIN_SRC sh
       cd ~/android/system
       source build/envsetup.sh
       lunch
     #+END_SRC
* Links
  - http://android.stackexchange.com/questions/29828/how-can-i-mount-or-unmount-the-sd-card-using-adb
  - http://developer.android.com/tools/index.html
  - http://download.cyanogenmod.org/?type=stable&device=desirec
  - http://forums.devshed.com/python-programming-11/importerror-no-module-named-cpickle-938161.html
  - http://get.cm/?device=desirec
  - http://goo.im/gapps
  - http://wiki.cyanogenmod.org/w/ADB
  - http://wiki.cyanogenmod.org/w/Build_for_desirec#Download_the_source_code
  - http://wiki.cyanogenmod.org/w/Community
  - http://wiki.cyanogenmod.org/w/Install_CM_for_desirec
  - http://wiki.rootzwiki.com/Google_Apps
  - http://www.addictivetips.com/mobile/the-complete-review-of-cyanogenmod-7-walkthrough-guide/#1
  - http://www.droidforums.net/forum/motorola-droid/6489-how-pair-bluetooth-blueant-z9i.html
  - http://www.economyofeffort.com/2010/07/30/turn-an-android-handset-into-a-free-wifi-phone-with-google-voice/
  - https://code.google.com/p/cyanogenmod-kovsky/downloads/detail?name=gapps-gb-20110828-signed.zip&can=2&q=
  - https://groups.google.com/forum/?fromgroups=#!topic/android-discuss/-Fp5VkTmW1k
  - https://www.linux.com/learn/tutorials/698725-how-to-install-cyanogenmod-on-an-android-phone
* Android Applications
** GrooVe IP Lite
   - Access Request :: ouath2:https://www.googleapis.com/auth/googletalk
   - http://snrblabs.com/snrb/grooveIp.aspx
*** Echo problem on reciever end
   - Change microphone volume from -2 to -8
   - Change speaker volume from 0 to -5
