android-eris-step-by-step.html

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> HTC Droid Eris</h2>
<div class="outline-text-2" id="text-8">

<dl>
<dt>Screen</dt><dd>3.2 inch HVGA 320x480
</dd>
<dt>Device Definition</dt><dd>3.2" HVGA slider ADP1 (320 x 480, Normal mdpi screen)  
</dd>
</dl>

</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Build</h2>
<div class="outline-text-2" id="text-9">

<ol>
<li><code>[&nbsp;]</code> <a href="http://wiki.cyanogenmod.org/w/Build_for_desirec">http://wiki.cyanogenmod.org/w/Build<sub>for</sub><sub>desirec</sub></a>
</li>
<li><code>[&nbsp;]</code> 



<pre class="example">mkdir -p ~/bin
mkdir -p ~/android/system
</pre>

</li>
<li><code>[&nbsp;]</code> repo



<pre class="example">cd ~/bin &amp;&amp; wget https://dl-ssl.google.com/dl/googlesource/git-repo/repo &amp;&amp; chmod +x ~/bin/repo
</pre>

</li>
<li><code>[&nbsp;]</code> path



<pre class="example">export PATH=${PATH}:~/bin
</pre>

</li>
<li>[ ]



<pre class="example">cd ~/android/system/
repo init -u git://github.com/CyanogenMod/android.git -b gingerbread
</pre>


<pre class="example">repo sync
</pre>

</li>
<li><code>[&nbsp;]</code> Get prebuilt Rom Manager



<pre class="example">cd ~/android/system/vendor/cyanogen &amp;&amp; ./get-rommanager
</pre>

</li>
<li><code>[&nbsp;]</code> 



<pre class="example">cd ~/android/system
source build/envsetup.sh
lunch
</pre>

</li>
</ol>

</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Links</h2>
<div class="outline-text-2" id="text-10">

<ul>
<li><a href="http://android.stackexchange.com/questions/29828/how-can-i-mount-or-unmount-the-sd-card-using-adb">http://android.stackexchange.com/questions/29828/how-can-i-mount-or-unmount-the-sd-card-using-adb</a>
</li>
<li><a href="http://developer.android.com/tools/index.html">http://developer.android.com/tools/index.html</a>
</li>
<li><a href="http://download.cyanogenmod.org/?type=stable&amp;device=desirec">http://download.cyanogenmod.org/?type=stable&amp;device=desirec</a>
</li>
<li><a href="http://forums.devshed.com/python-programming-11/importerror-no-module-named-cpickle-938161.html">http://forums.devshed.com/python-programming-11/importerror-no-module-named-cpickle-938161.html</a>
</li>
<li><a href="http://get.cm/?device=desirec">http://get.cm/?device=desirec</a>
</li>
<li><a href="http://goo.im/gapps">http://goo.im/gapps</a>
</li>
<li><a href="http://wiki.cyanogenmod.org/w/ADB">http://wiki.cyanogenmod.org/w/ADB</a>
</li>
<li><a href="http://wiki.cyanogenmod.org/w/Build_for_desirec#Download_the_source_code">http://wiki.cyanogenmod.org/w/Build_for_desirec#Download_the_source_code</a>
</li>
<li><a href="http://wiki.cyanogenmod.org/w/Community">http://wiki.cyanogenmod.org/w/Community</a>
</li>
<li><a href="http://wiki.cyanogenmod.org/w/Install_CM_for_desirec">http://wiki.cyanogenmod.org/w/Install_CM_for_desirec</a>
</li>
<li><a href="http://wiki.rootzwiki.com/Google_Apps">http://wiki.rootzwiki.com/Google_Apps</a>
</li>
<li><a href="http://www.addictivetips.com/mobile/the-complete-review-of-cyanogenmod-7-walkthrough-guide/#1">http://www.addictivetips.com/mobile/the-complete-review-of-cyanogenmod-7-walkthrough-guide/#1</a>
</li>
<li><a href="http://www.droidforums.net/forum/motorola-droid/6489-how-pair-bluetooth-blueant-z9i.html">http://www.droidforums.net/forum/motorola-droid/6489-how-pair-bluetooth-blueant-z9i.html</a>
</li>
<li><a href="http://www.economyofeffort.com/2010/07/30/turn-an-android-handset-into-a-free-wifi-phone-with-google-voice/">http://www.economyofeffort.com/2010/07/30/turn-an-android-handset-into-a-free-wifi-phone-with-google-voice/</a>
</li>
<li><a href="https://code.google.com/p/cyanogenmod-kovsky/downloads/detail?name=gapps-gb-20110828-signed.zip&amp;can=2&amp;q">https://code.google.com/p/cyanogenmod-kovsky/downloads/detail?name=gapps-gb-20110828-signed.zip&amp;can=2&amp;q</a>=
</li>
<li><a href="https://groups.google.com/forum/?fromgroups=#!topic/android-discuss/-Fp5VkTmW1k">https://groups.google.com/forum/?fromgroups=#!topic/android-discuss/-Fp5VkTmW1k</a>
</li>
<li><a href="https://www.linux.com/learn/tutorials/698725-how-to-install-cyanogenmod-on-an-android-phone">https://www.linux.com/learn/tutorials/698725-how-to-install-cyanogenmod-on-an-android-phone</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Android Applications</h2>
<div class="outline-text-2" id="text-11">


</div>

<div id="outline-container-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> GrooVe IP Lite</h3>
<div class="outline-text-3" id="text-11-1">

<dl>
<dt>Access Request</dt><dd>ouath2:<a href="https://www.googleapis.com/auth/googletalk">https://www.googleapis.com/auth/googletalk</a>
</dd>
<dt>???</dt><dd><a href="http://snrblabs.com/snrb/grooveIp.aspx">http://snrblabs.com/snrb/grooveIp.aspx</a>
</dd>
</dl>


</div>

<div id="outline-container-11-1-1" class="outline-4">
<h4 id="sec-11-1-1"><span class="section-number-4">11.1.1</span> Echo problem on reciever end</h4>
<div class="outline-text-4" id="text-11-1-1">

<ul>
<li>Change microphone volume from -2 to -8
</li>
<li>Change speaker volume from 0 to -5
</li>
</ul>

</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-04-21T16:18-0700</p>
<p class="author">Author: </p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
